package com.javarush.test.level03.lesson04.task03;

/* Бендер мой любимый учитель
Вывести на экран 'Бендер мой любимый учитель' 1 раз.
*/

public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Бендер мой любимый учитель");
    }
}