package com.javarush.test.level12.lesson04.task03;

/* Пять методов print с разными параметрами
Написать пять методов print с разными параметрами.
*/

class Solution {

  void print(int a) {
    System.out.println(a);
  }

  void print(float a) {
    System.out.println(a);
  }

  void print(double a) {
    System.out.println(a);
  }

  void print(char a) {
    System.out.println(a);
  }

  void print(String a) {
    System.out.println(a);
  }
}
